bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY2313.xml
            <module name="USART">
                <instance name="USART" caption="USART">
                    <register-group name="USART" name-in-module="USART" offset="0x00" address-space="data"
                                    caption="USART"/>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                    caption="EEPROM"/>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2"/>
                        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
                    </parameters>
                </instance>
            </module>
            <module name="USI">
                <instance name="USI" caption="Universal Serial Interface">
                    <register-group name="USI" name-in-module="USI" offset="0x00" address-space="data"
                                    caption="Universal Serial Interface"/>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="2" name="INT1" caption="External Interrupt Request 1"/>
            <interrupt index="3" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
            <interrupt index="4" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
            <interrupt index="5" name="TIMER1_OVF" caption="Timer/Counter1 Overflow"/>
            <interrupt index="6" name="TIMER0_OVF" caption="Timer/Counter0 Overflow"/>
            <interrupt index="7" name="USART_RX" caption="USART, Rx Complete"/>
            <interrupt index="8" name="USART_UDRE" caption="USART Data Register Empty"/>
            <interrupt index="9" name="USART_TX" caption="USART, Tx Complete"/>
            <interrupt index="10" name="ANA_COMP" caption="Analog Comparator"/>
            <interrupt index="11" name="PCINT" caption=""/>
            <interrupt index="12" name="TIMER1_COMPB" caption=""/>
            <interrupt index="13" name="TIMER0_COMPA" caption=""/>
            <interrupt index="14" name="TIMER0_COMPB" caption=""/>
            <interrupt index="15" name="USI_START" caption="USI Start Condition"/>
            <interrupt index="16" name="USI_OVERFLOW" caption="USI Overflow"/>
            <interrupt index="17" name="EEPROM_Ready" caption=""/>
            <interrupt index="18" name="WDT_OVERFLOW" caption="Watchdog Timer Overflow"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
            <interface name="debugWIRE" type="dw"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x910A"/>
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x91"/>
                <property name="SIGNATURE2" value="0x0a"/>
            </property-group>
            <property-group name="OCD">
                <property name="OCD_REVISION" value="0"/>
                <property name="OCD_DATAREG" value="0x1f"/>
                <property name="PROGBASE" value="0x0000"/>
            </property-group>
            <property-group name="JTAG_INTERFACE">
                <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="32"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="6"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0E 0x1E 0x2E 0x3E 0x2E 0x3E 0x4E 0x5E 0x4E 0x5E 0x6E 0x7E 0x6E 0x7E 0x26 0x36 0x66 0x76 0x2A 0x3A 0x6A 0x7A 0x2E 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="32"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="6"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0E 0x1E 0x2E 0x3E 0x2E 0x3E 0x4E 0x5E 0x4E 0x5E 0x6E 0x7E 0x6E 0x7E 0x26 0x36 0x66 0x76 0x2A 0x3A 0x6A 0x7A 0x2E 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="20"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="PP_INTERFACE_AVRDRAGON">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0E 0x1E 0x2E 0x3E 0x2E 0x3E 0x4E 0x5E 0x4E 0x5E 0x6E 0x7E 0x6E 0x7E 0x26 0x36 0x66 0x76 0x2A 0x3A 0x6A 0x7A 0x2E 0xFD 0x04 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0B"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xFF">
                    <bitfield caption="Self Programming enable" mask="0x01" name="SELFPRGEN"/>
                </register>
                <register caption="" name="HIGH" offset="0x01" size="1" initval="0xDF">
                    <bitfield caption="Debug Wire enable" mask="0x80" name="DWEN"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x40" name="EESAVE"/>
                    <bitfield caption="Serial program downloading (SPI) enable" mask="0x20" name="SPIEN"/>
                    <bitfield caption="Watch-dog Timer always on" mask="0x10" name="WDTON"/>
                    <bitfield caption="Brown-out Detector trigger level" mask="0x0E" name="BODLEVEL"
                              values="ENUM_EESAVE_BODLEVEL"/>
                    <bitfield caption="External reset disable" mask="0x01" name="RSTDISBL"/>
                </register>
                <register caption="" name="LOW" offset="0x00" size="1" initval="0x64">
                    <bitfield caption="Divide clock by 8 internally" mask="0x80" name="CKDIV8"/>
                    <bitfield caption="Clock output on PORTD2" mask="0x40" name="CKOUT"/>
                    <bitfield caption="Select Clock Source" mask="0x3F" name="SUT_CKSEL" values="ENUM_SUT_CKSEL"/>
                </register>
            </register-group>
