bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY2313.xml
            <value-group caption="" name="ENUM_SUT_CKSEL">
                <value caption="Ext. Clock; Start-up time: 14 CK + 0   ms" name="EXTCLK_14CK_0MS" value="0x00"/>
                <value caption="Ext. Clock; Start-up time: 14 CK + 4.1 ms" name="EXTCLK_14CK_4MS1" value="0x10"/>
                <value caption="Ext. Clock; Start-up time: 14 CK + 65  ms" name="EXTCLK_14CK_65MS" value="0x20"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 14 CK + 0   ms" name="INTRCOSC_4MHZ_14CK_0MS"
                       value="0x02"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 14 CK + 4.1 ms" name="INTRCOSC_4MHZ_14CK_4MS1"
                       value="0x12"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 14 CK + 65  ms" name="INTRCOSC_4MHZ_14CK_65MS"
                       value="0x22"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 14 CK + 0   ms" name="INTRCOSC_8MHZ_14CK_0MS"
                       value="0x04"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 14 CK + 4.1 ms" name="INTRCOSC_8MHZ_14CK_4MS1"
                       value="0x14"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65  ms" name="INTRCOSC_8MHZ_14CK_65MS"
                       value="0x24"/>
                <value caption="Int. RC Osc. 128 kHz; Start-up time: 14 CK + 0 ms" name="INTRCOSC_128KHZ_14CK_0MS"
                       value="0x06"/>
                <value caption="Int. RC Osc. 128 kHz; Start-up time: 14 CK + 4 ms" name="INTRCOSC_128KHZ_14CK_4MS"
                       value="0x16"/>
                <value caption="Int. RC Osc. 128 kHz; Start-up time: 14 CK + 64 ms" name="INTRCOSC_128KHZ_14CK_64MS"
                       value="0x26"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1" value="0x08"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_65MS" value="0x18"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_0MS" value="0x28"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1" value="0x38"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_65MS" value="0x09"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_0MS" value="0x19"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1" value="0x29"/>
                <value caption="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ4_0MHZ9_14CK_65MS" value="0x39"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_4MS1" value="0x0A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_65MS" value="0x1A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_0MS" value="0x2A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_4MS1" value="0x3A"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_65MS" value="0x0B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_0MS" value="0x1B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_4MS1" value="0x2B"/>
                <value caption="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_0MHZ9_3MHZ_14CK_65MS" value="0x3B"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_4MS1" value="0x0C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_65MS" value="0x1C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_0MS" value="0x2C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_4MS1" value="0x3C"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_65MS" value="0x0D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_0MS" value="0x1D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_4MS1" value="0x2D"/>
                <value caption="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_3MHZ_8MHZ_14CK_65MS" value="0x3D"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_4MS1" value="0x0E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_65MS" value="0x1E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_0MS" value="0x2E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_4MS1" value="0x3E"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_65MS" value="0x0F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_0MS" value="0x1F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_4MS1" value="0x2F"/>
                <value caption="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms"
                       name="EXTXOSC_8MHZ_XX_14CK_65MS" value="0x3F"/>
            </value-group>
            <value-group caption="" name="ENUM_EESAVE_BODLEVEL">
                <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
                <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
                <value caption="Brown-out detection disabled" name="DISABLED" value="0x07"/>
            </value-group>
        </module>
