bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY2313.xml
                <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x51" size="1" mask="0x7F"
                          ocd-rw="R">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x46" size="1" ocd-rw="">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="General Timer Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="" mask="0x01" name="PSR10"/>
                </register>
                <register caption="Pin-Change Mask register" name="PCMSK" offset="0x40" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x35" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x34" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x33" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8 MHz" name="8_MHz"/>
                <value value="0x01" caption="4 MHz" name="4_MHz"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_2BITS">
                <value value="0x00" caption="Idle" name="IDLE"/>
                <value value="0x01" caption="Power Down" name="PDOWN2"/>
                <value value="0x04" caption="Standby" name="STDBY"/>
                <value value="0x05" caption="Power Down " name="PDOWN"/>
            </value-group>
        </module>
        <module caption="Universal Serial Interface" name="USI">
            <register-group caption="Universal Serial Interface" name="USI">
                <register caption="USI Data Register" name="USIDR" offset="0x2F" size="1" mask="0xFF"/>
                <register caption="USI Status Register" name="USISR" offset="0x2E" size="1" ocd-rw="R">
                    <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
                    <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
                    <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
                    <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
                    <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
                </register>
                <register caption="USI Control Register" name="USICR" offset="0x2D" size="1">
                    <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
                    <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
                    <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
                    <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
                    <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
                    <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_USI_OP">
                <value caption="Normal Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Three-Wire Mode" name="VAL_0x01" value="0x01"/>
                <value caption="Two-Wire Mode" name="VAL_0x02" value="0x02"/>
                <value caption="Two-Wire Mode Held Low" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="PDIP_SOIC_20">
            <pin position="1" pad="PA2"/>
            <pin position="2" pad="PD0"/>
            <pin position="3" pad="PD1"/>
            <pin position="4" pad="PA1"/>
            <pin position="5" pad="PA0"/>
            <pin position="6" pad="PD2"/>
            <pin position="7" pad="PD3"/>
            <pin position="8" pad="PD4"/>
            <pin position="9" pad="PD5"/>
            <pin position="10" pad="GND"/>
            <pin position="11" pad="PD6"/>
            <pin position="12" pad="PB0"/>
            <pin position="13" pad="PB1"/>
            <pin position="14" pad="PB2"/>
            <pin position="15" pad="PB3"/>
            <pin position="16" pad="PB4"/>
            <pin position="17" pad="PB5"/>
            <pin position="18" pad="PB6"/>
            <pin position="19" pad="PB7"/>
            <pin position="20" pad="VCC"/>
        </pinout>
        <pinout name="QFN20">
            <pin position="1" pad="PD1"/>
            <pin position="2" pad="PA1"/>
            <pin position="3" pad="PA0"/>
            <pin position="4" pad="PD2"/>
            <pin position="5" pad="PD3"/>
            <pin position="6" pad="PD4"/>
            <pin position="7" pad="PD5"/>
            <pin position="8" pad="GND"/>
            <pin position="9" pad="PD6"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="VCC"/>
            <pin position="19" pad="PA2"/>
            <pin position="20" pad="PD0"/>
        </pinout>
    </pinouts>
</target-description-file>
